app/controllers/articles_controller.rb

	def show
		title = params[:title]

		@contents = Article.find_by(title: title)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."title" = ? LIMIT 1  [["title", "hello"]]